In [62]:
import pandas as pd

In [63]:
data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-05-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

In [64]:
activity

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-05-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

Write a solution to find the first login date for each player.

In [65]:
activity.head()

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-05-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [66]:
new_df = pd.DataFrame()

In [67]:
activity["player_id"].head()

0    1
1    1
2    2
3    3
4    3
Name: player_id, dtype: Int64

In [68]:
for row_index, row in activity.iterrows():
    print(row_index, row, sep="\n")

0
player_id                         1
device_id                         2
event_date      2016-03-01 00:00:00
games_played                      5
Name: 0, dtype: object
1
player_id                         1
device_id                         2
event_date      2016-05-02 00:00:00
games_played                      6
Name: 1, dtype: object
2
player_id                         2
device_id                         3
event_date      2017-06-25 00:00:00
games_played                      1
Name: 2, dtype: object
3
player_id                         3
device_id                         1
event_date      2016-03-02 00:00:00
games_played                      0
Name: 3, dtype: object
4
player_id                         3
device_id                         4
event_date      2018-07-03 00:00:00
games_played                      5
Name: 4, dtype: object

In [69]:
for label, ser in activity.items():
    print(label)
    print(ser)

player_id
0    1
1    1
2    2
3    3
4    3
Name: player_id, dtype: Int64
device_id
0    2
1    2
2    3
3    1
4    4
Name: device_id, dtype: Int64
event_date
0   2016-03-01
1   2016-05-02
2   2017-06-25
3   2016-03-02
4   2018-07-03
Name: event_date, dtype: datetime64[ns]
games_played
0    5
1    6
2    1
3    0
4    5
Name: games_played, dtype: Int64

In [54]:
import numpy as np

df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df

     A      B         C         D
0  foo    one  1.061855 -0.767372
1  bar    one  0.733535  0.935851
2  foo    two -0.449895 -0.766826
3  bar  three -0.997584  1.206532
4  foo    two  0.285267  0.355907
5  bar    two  0.503914 -0.798585
6  foo    one  0.802690 -0.773058
7  foo  three -0.177662  1.733270

In [57]:
grouped = df.groupby(["A"])
grouped.head()

     A      B         C         D
0  foo    one  1.061855 -0.767372
1  bar    one  0.733535  0.935851
2  foo    two -0.449895 -0.766826
3  bar  three -0.997584  1.206532
4  foo    two  0.285267  0.355907
5  bar    two  0.503914 -0.798585
6  foo    one  0.802690 -0.773058
7  foo  three -0.177662  1.733270

In [58]:
grouped_C = grouped["C"]
grouped_C.head()

0    1.061855
1    0.733535
2   -0.449895
3   -0.997584
4    0.285267
5    0.503914
6    0.802690
7   -0.177662
Name: C, dtype: float64

In [59]:
grouped_D = grouped["D"]
grouped_D.head()

0   -0.767372
1    0.935851
2   -0.766826
3    1.206532
4    0.355907
5   -0.798585
6   -0.773058
7    1.733270
Name: D, dtype: float64

In [61]:
for name, group in grouped:
    print(name)
    print(group)

('bar',)
     A      B         C         D
1  bar    one  0.733535  0.935851
3  bar  three -0.997584  1.206532
5  bar    two  0.503914 -0.798585
('foo',)
     A      B         C         D
0  foo    one  1.061855 -0.767372
2  foo    two -0.449895 -0.766826
4  foo    two  0.285267  0.355907
6  foo    one  0.802690 -0.773058
7  foo  three -0.177662  1.733270

In [73]:
activity_grouped = activity.groupby(["player_id"])

In [79]:
for name, group in activity_grouped:
    print(name)
    print(group)

(1,)
   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-05-02             6
(2,)
   player_id  device_id event_date  games_played
2          2          3 2017-06-25             1
(3,)
   player_id  device_id event_date  games_played
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [75]:
activity_grouped_time = activity_grouped["event_date"]

In [77]:
activity_grouped_time.head()

0   2016-03-01
1   2016-05-02
2   2017-06-25
3   2016-03-02
4   2018-07-03
Name: event_date, dtype: datetime64[ns]

In [98]:
activity_agg = (
    activity.groupby("player_id", as_index=False).agg(
        event_date = pd.NamedAgg(column="event_date", aggfunc="min"))
    .rename(columns={"player_id":"player_id", "event_date":"last_login"})
)

In [99]:
activity_agg.head()

          last_login
player_id
1         2016-03-01
2         2017-06-25
3         2016-03-02

In [100]:
solution = (
    activity.groupby('player_id')['event_date']
    .min()
    .reset_index()
    .rename(columns={'event_date':'first_login'})
)

In [101]:
solution.head()

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02